DillonSimeone/Website/public/ESP32Codes/PlatformIO/02_Audio_Haptics/Haxel/firmware/src/web/ApiHandlers.cpp
#include "ApiHandlers.h"
#include "../core/Engine.h"
#include "../core/Config.h"
#include "../core/AudioAnalyzer.h"
#include "../core/PatternRegistry.h"
#include "../patterns/CustomPattern.h"
#include "../patterns/Patterns.h"
#include <ArduinoJson.h>
#include <AsyncJson.h>
#include <Update.h>

namespace haxel::web {

using namespace haxel::core;

namespace {

void serializeState(JsonObject root, Engine* engine) {
    StagedState s;
    engine->copyState(s);
    root["on"] = s.on;
    root["mute"] = s.mute;
    root["intensity"] = s.intensity;
    root["speed"] = s.speed;
    root["pattern"] = s.pattern ? s.pattern->id() : "";
    root["startupFloor"] = s.startupFloor;
    root["numBins"] = s.numBins;

    auto divs = root["dividers"].to<JsonArray>();
    for (int i = 0; i < s.numBins - 1 && i < 4; ++i) {
        divs.add(s.dividers[i]);
    }

    auto binPats = root["binPatterns"].to<JsonArray>();
    for (int i = 0; i < s.numBins && i < 5; ++i) {
        binPats.add(s.binPatterns[i]);
    }

    auto ch = root["channels"].to<JsonArray>();
    for (int i = 0; i < s.channelCount; ++i) {
        auto c = ch.add<JsonObject>();
        c["on"] = s.channels[i].on;
        c["intensity"] = s.channels[i].intensity;
    }
    auto info = root["info"].to<JsonObject>();
    info["version"] = HAXEL_VERSION_STR;
    info["uptime_ms"] = millis();
    info["heap_free"] = ESP.getFreeHeap();
}

void applyStatePatch(JsonObjectConst patch, Engine* engine) {
    StagedState s;
    engine->copyState(s);
    if (patch["on"].is<bool>())        s.on        = patch["on"].as<bool>();
    if (patch["mute"].is<bool>())      s.mute      = patch["mute"].as<bool>();
    if (patch["intensity"].is<float>())s.intensity = patch["intensity"].as<float>();
    if (patch["speed"].is<float>())    s.speed     = patch["speed"].as<float>();
    if (patch["clear"].is<bool>())     s.clearFault = patch["clear"].as<bool>();

    if (patch["startupFloor"].is<float>()) s.startupFloor = patch["startupFloor"].as<float>();
    if (patch["numBins"].is<int>())        s.numBins      = patch["numBins"].as<int>();
    if (patch["dividers"].is<JsonArrayConst>()) {
        int i = 0;
        for (JsonVariantConst v : patch["dividers"].as<JsonArrayConst>()) {
            if (i < 4) s.dividers[i++] = v.as<int>();
        }
    }
    if (patch["binPatterns"].is<JsonArrayConst>()) {
        int i = 0;
        for (JsonVariantConst v : patch["binPatterns"].as<JsonArrayConst>()) {
            if (i < 5) {
                strncpy(s.binPatterns[i], v.as<const char*>(), sizeof(s.binPatterns[i]) - 1);
                s.binPatterns[i][sizeof(s.binPatterns[i]) - 1] = '\0';
                i++;
            }
        }
    }

    if (patch["bri"].is<int>()) s.intensity = patch["bri"].as<int>() / 255.0f;

    if (patch["pattern"].is<const char*>()) {
        const char* pid = patch["pattern"].as<const char*>();
        IPattern* p = PatternRegistry::instance().find(pid);
        if (p) s.pattern = p;
    }
    if (patch["seg"][0]["fx"].is<int>()) {
        int idx = patch["seg"][0]["fx"].as<int>();
        IPattern* p = PatternRegistry::instance().at((size_t)idx);
        if (p) s.pattern = p;
    }
    if (patch["params"].is<JsonObjectConst>() && s.pattern) {
        for (auto kv : patch["params"].as<JsonObjectConst>()) {
            s.pattern->setParam(kv.key().c_str(), kv.value().as<float>());
        }
    }
    engine->stageState(s);
}

void applyConfigPatch(JsonObjectConst patch, Config* config) {
    if (patch["driver"].is<JsonObjectConst>()) {
        hal::DriverConfig dc = config->driverConfig();
        JsonObjectConst d = patch["driver"].as<JsonObjectConst>();
        if (d["kind"].is<int>()) {
            config->setDriverKind((hal::DriverKind)(int)d["kind"]);
            dc.kind = config->driverKind();
        }
        if (d["pins"].is<JsonArrayConst>()) {
            int i = 0;
            for (JsonVariantConst p : d["pins"].as<JsonArrayConst>()) {
                if (i < 8) dc.pins[i++] = p.as<int>();
            }
        }
        if (d["sda"].is<int>())   dc.sda   = d["sda"];
        if (d["scl"].is<int>())   dc.scl   = d["scl"];
        if (d["pwmHz"].is<int>()) dc.pwmHz = d["pwmHz"];
        if (d["flags"].is<uint32_t>()) dc.flags = d["flags"];
        config->setDriverConfig(dc);
    }
    if (patch["hostname"].is<const char*>()) {
        config->setHostname(patch["hostname"].as<const char*>());
    }
    if (patch["knobs"].is<JsonArrayConst>()) {
        KnobConfig knobs[Config::kMaxKnobs];
        size_t count = 0;
        for (JsonObjectConst k : patch["knobs"].as<JsonArrayConst>()) {
            if (count >= Config::kMaxKnobs) break;
            knobs[count].enabled = k["enabled"] | true;
            knobs[count].pin     = k["pin"]     | -1;
            knobs[count].param   = (const char*)(k["param"] | "none");
            count++;
        }
        config->setKnobs(knobs, count);
    }
    if (patch["oled"].is<JsonObjectConst>()) {
        OledConfig oc = config->oledConfig();
        JsonObjectConst o = patch["oled"].as<JsonObjectConst>();
        if (o["enabled"].is<bool>()) oc.enabled = o["enabled"];
        if (o["sda"].is<int>())      oc.sda     = o["sda"];
        if (o["scl"].is<int>())      oc.scl     = o["scl"];
        if (o["i2cAddr"].is<int>())  oc.i2cAddr = (uint8_t)o["i2cAddr"].as<int>();
        if (o["width"].is<int>())    oc.width   = o["width"];
        if (o["height"].is<int>())   oc.height  = o["height"];
        config->setOledConfig(oc);
    }
    config->setFirstRunComplete();
    config->save();
}

} // anon

void ApiHandlers::install(AsyncWebServer& server, Engine* engine, Config* config, AudioAnalyzer* audio) {

    // ----- GET endpoints -----

    server.on("/json/gpios", HTTP_GET, [](AsyncWebServerRequest* req) {
        JsonDocument doc;
#if defined(CONFIG_IDF_TARGET_ESP32C3)
        doc["target"] = "esp32-c3";
        int safe[] = {0,1,2,3,4,5,6,7,8,9,10,20,21};
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
        doc["target"] = "esp32-s3";
        int safe[] = {1,2,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,21,33,34,35,36,37,38,39,40,41,42,47,48};
#else
        doc["target"] = "esp32";
        int safe[] = {4,13,14,16,17,18,19,21,22,23,25,26,27,32,33};
#endif
        auto arr = doc["available"].to<JsonArray>();
        for (int p : safe) arr.add(p);
        auto adc = doc["adc"].to<JsonArray>();
#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
        int adcPins[] = {0, 1, 2, 3, 4};
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
        int adcPins[] = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20};
#else
        int adcPins[] = {32,33,34,35,36,37,38,39};
#endif
        for (int p : adcPins) adc.add(p);
        String body; serializeJson(doc, body);
        req->send(200, "application/json", body);
    });

    server.on("/json/config", HTTP_GET, [config](AsyncWebServerRequest* req) {
        JsonDocument doc;
        doc["firstRun"] = config->firstRun();
        doc["hostname"] = config->hostname();
        auto drv = doc["driver"].to<JsonObject>();
        drv["kind"]  = (int)config->driverKind();
        const auto& dc = config->driverConfig();
        auto pins = drv["pins"].to<JsonArray>();
        for (int i = 0; i < 8; ++i) pins.add(dc.pins[i]);
        drv["sda"] = dc.sda;
        drv["scl"] = dc.scl;
        drv["pwmHz"] = dc.pwmHz;

        auto au = doc["audio"].to<JsonObject>();
        au["enabled"] = config->audioEnabled();
        au["gain"]    = config->audioConfig().gain;

        auto ld = doc["led"].to<JsonObject>();
        ld["enabled"] = config->ledEnabled();
        ld["pin"]     = config->ledConfig().pin;
        ld["count"]   = config->ledConfig().count;

        auto knobs = doc["knobs"].to<JsonArray>();
        for (size_t i = 0; i < config->knobCount(); ++i) {
            const auto& k = config->knob(i);
            auto ko = knobs.add<JsonObject>();
            ko["enabled"] = k.enabled;
            ko["pin"]     = k.pin;
            ko["param"]   = k.param;
        }

        const auto& oc = config->oledConfig();
        auto ol = doc["oled"].to<JsonObject>();
        ol["enabled"] = config->oledEnabled();
        ol["sda"]     = oc.sda;
        ol["scl"]     = oc.scl;
        ol["i2cAddr"]  = oc.i2cAddr;
        ol["width"]    = oc.width;
        ol["height"]   = oc.height;

        String body; serializeJson(doc, body);
        req->send(200, "application/json", body);
    });

    server.on("/json", HTTP_GET, [engine](AsyncWebServerRequest* req) {
        JsonDocument doc;
        serializeState(doc["state"].to<JsonObject>(), engine);
        auto pats = doc["patterns"].to<JsonArray>();
        for (auto* p : PatternRegistry::instance().all()) {
            auto m = pats.add<JsonObject>();
            const auto& meta = p->meta();
            m["id"] = meta.id;
            m["category"] = meta.category;
            m["tags"] = meta.tags;
            m["description"] = meta.description;
            m["multiChannel"] = meta.multiChannel;
            m["usesAudio"] = meta.usesAudio;
            auto params = m["params"].to<JsonArray>();
            for (int i = 0; i < meta.paramCount; ++i) {
                const auto& pm = meta.params[i];
                auto pe = params.add<JsonObject>();
                pe["id"] = pm.id;
                pe["label"] = pm.label;
                pe["type"] = (int)pm.type;
                pe["min"] = pm.minV;
                pe["max"] = pm.maxV;
                pe["default"] = pm.defaultV;
            }
        }
        String body; serializeJson(doc, body);
        req->send(200, "application/json", body);
    });

    server.on("/json/state", HTTP_GET, [engine](AsyncWebServerRequest* req) {
        JsonDocument doc;
        serializeState(doc.to<JsonObject>(), engine);
        String body; serializeJson(doc, body);
        req->send(200, "application/json", body);
    });

    server.on("/json/diag", HTTP_GET, [engine, audio](AsyncWebServerRequest* req) {
        JsonDocument doc;
        auto d = engine->diag();
        doc["uptime_ms"] = millis();
        doc["heap_free"] = ESP.getFreeHeap();
        doc["tick_count"] = d.tickCount;
        auto j = doc["jitter_us"].to<JsonObject>();
        j["p50"] = d.jitterP50_us;
        j["p99"] = d.jitterP99_us;
        j["max"] = d.jitterMax_us;
        doc["state"] = (int)d.state;
        doc["fault"] = d.faultCode ? d.faultCode : (const char*)nullptr;
        doc["audio_ready"] = audio && audio->ready();
        String body; serializeJson(doc, body);
        req->send(200, "application/json", body);
    });

    // ----- JSON POST/PUT endpoints via AsyncCallbackJsonWebHandler -----
    // This is the canonical pattern: the framework owns body buffering,
    // content-type check, and JSON parse. Our callback gets a parsed
    // JsonVariant and is responsible only for the response.

    auto* stateJson = new AsyncCallbackJsonWebHandler("/json/state",
        [engine](AsyncWebServerRequest* req, JsonVariant& json) {
            JsonObjectConst patch = json.as<JsonObjectConst>();
            if (patch["reboot"].is<bool>() && patch["reboot"].as<bool>()) {
                req->send(200, "application/json", "{\"ok\":true,\"reboot\":true}");
                delay(800);
                ESP.restart();
                return;
            }
            applyStatePatch(patch, engine);
            JsonDocument out;
            serializeState(out.to<JsonObject>(), engine);
            String body; serializeJson(out, body);
            req->send(200, "application/json", body);
        });
    stateJson->setMethod(HTTP_POST | HTTP_PUT);
    server.addHandler(stateJson);

    auto* configJson = new AsyncCallbackJsonWebHandler("/json/config",
        [config](AsyncWebServerRequest* req, JsonVariant& json) {
            applyConfigPatch(json.as<JsonObjectConst>(), config);
            req->send(200, "application/json", "{\"ok\":true,\"reboot\":true}");
            // Generous flush window before reboot — async send queues the
            // response into AsyncTCP and we need the socket to drain.
            delay(800);
            ESP.restart();
        });
    configJson->setMethod(HTTP_POST | HTTP_PUT);
    server.addHandler(configJson);

    // ----- Query-param POSTs -----

    auto buzzHandler = [engine](AsyncWebServerRequest* req) {
        float intensity = 0.7f;
        uint32_t ms     = 600;
        if (req->hasParam("intensity")) intensity = req->getParam("intensity")->value().toFloat();
        if (req->hasParam("ms"))        ms        = req->getParam("ms")->value().toInt();

        StagedState s;
        engine->copyState(s);
        s.on = true;
        s.intensity = intensity;
        IPattern* p = PatternRegistry::instance().find("Pulse");
        if (p) {
            p->setParam("period_ms", (float)(ms * 2));
            p->setParam("duty",      0.5f);
            p->setParam("intensity", 1.0f);
            s.pattern = p;
        }
        engine->stageState(s);
        req->send(200, "application/json", String("{\"ok\":true,\"ms\":") + ms + "}");
    };
    server.on("/json/buzz", HTTP_GET,  buzzHandler);
    server.on("/json/buzz", HTTP_POST, buzzHandler);

    // ----- Custom Patterns Studio API -----

    server.on("/json/custom-patterns", HTTP_GET, [](AsyncWebServerRequest* req) {
        JsonDocument doc;
        JsonArray arr = doc.to<JsonArray>();
        for (auto* p : PatternRegistry::instance().all()) {
            if (strcmp(p->meta().category, "custom") == 0) {
                patterns::CustomPattern* cp = static_cast<patterns::CustomPattern*>(p);
                if (cp) {
                    JsonObject obj = arr.add<JsonObject>();
                    obj["id"] = cp->meta().id;
                    obj["name"] = cp->getName();
                    obj["code"] = cp->getCode();
                }
            }
        }
        String body;
        serializeJson(doc, body);
        req->send(200, "application/json", body);
    });

    auto* customPatternPost = new AsyncCallbackJsonWebHandler("/json/custom-patterns",
        [](AsyncWebServerRequest* req, JsonVariant& json) {
            JsonObjectConst obj = json.as<JsonObjectConst>();
            std::string id = obj["id"] | "";
            std::string name = obj["name"] | "";
            std::string code = obj["code"] | "";
            if (id.empty() || code.empty()) {
                req->send(400, "application/json", "{\"ok\":false,\"error\":\"id and code are required\"}");
                return;
            }
            
            patterns::CustomPatternEvaluator evaluator;
            if (!evaluator.compile(code)) {
                req->send(400, "application/json", "{\"ok\":false,\"error\":\"" + String(evaluator.getLastError().c_str()) + "\"}");
                return;
            }
            
            // Remove existing pattern if it exists
            PatternRegistry::instance().unregisterPattern(id.c_str());
            
            // Register new CustomPattern
            patterns::CustomPattern* cp = new patterns::CustomPattern(id, name, code);
            PatternRegistry::instance().registerCustomPattern(cp);
            
            // Save to LittleFS
            patterns::saveCustomPatterns(PatternRegistry::instance());
            
            req->send(200, "application/json", "{\"ok\":true}");
        });
    customPatternPost->setMethod(HTTP_POST | HTTP_PUT);
    server.addHandler(customPatternPost);

    server.on("/json/custom-patterns", HTTP_DELETE, [](AsyncWebServerRequest* req) {
        String id = "";
        if (req->hasParam("id")) {
            id = req->getParam("id")->value();
        }
        if (id.length() == 0) {
            req->send(400, "application/json", "{\"ok\":false,\"error\":\"id parameter is required\"}");
            return;
        }
        
        PatternRegistry::instance().unregisterPattern(id.c_str());
        patterns::saveCustomPatterns(PatternRegistry::instance());
        
        req->send(200, "application/json", "{\"ok\":true}");
    });

    // ----- OTA -----

    server.on("/update", HTTP_POST,
        [](AsyncWebServerRequest* req) {
            bool ok = !Update.hasError();
            req->send(ok ? 200 : 400, "text/plain", ok ? "OK" : Update.errorString());
            if (ok) ESP.restart();
        },
        [](AsyncWebServerRequest* /*req*/, String /*filename*/, size_t index,
           uint8_t* data, size_t len, bool final) {
            if (index == 0) Update.begin(UPDATE_SIZE_UNKNOWN);
            Update.write(data, len);
            if (final) Update.end(true);
        });
}

void ApiHandlers::handleWlenWin(AsyncWebServerRequest* req, Engine* engine) {
    StagedState s;
    engine->copyState(s);
    if (req->hasParam("T")) {
        int t = req->getParam("T")->value().toInt();
        if (t == 0) s.on = false;
        else if (t == 1) s.on = true;
        else if (t == 2) s.on = !s.on;
    }
    if (req->hasParam("A")) {
        int a = req->getParam("A")->value().toInt();
        s.intensity = (a < 0 ? 0 : a > 255 ? 255 : a) / 255.0f;
    }
    if (req->hasParam("FX")) {
        int fx = req->getParam("FX")->value().toInt();
        IPattern* p = PatternRegistry::instance().at((size_t)fx);
        if (p) s.pattern = p;
    }
    if (req->hasParam("SX")) {
        int sx = req->getParam("SX")->value().toInt();
        s.speed = 0.25f + (sx / 255.0f) * 3.75f;
    }
    if (req->hasParam("RB")) { req->send(200, "text/plain", "OK"); ESP.restart(); return; }
    engine->stageState(s);
    req->send(200, "text/plain", "OK");
}

void ApiHandlers::handleWebSocket(AsyncWebSocket* /*server*/,
                                  AsyncWebSocketClient* client,
                                  AwsEventType type,
                                  void* arg, uint8_t* data, size_t len,
                                  Engine* engine) {
    if (type != WS_EVT_DATA) return;
    AwsFrameInfo* info = (AwsFrameInfo*)arg;
    if (!info->final || info->index != 0 || info->len != len) return;

    JsonDocument doc;
    if (deserializeJson(doc, data, len)) return;
    const char* msgType = doc["type"] | "";
    if (!strcmp(msgType, "state")) {
        applyStatePatch(doc["patch"].as<JsonObjectConst>(), engine);
    } else if (!strcmp(msgType, "external")) {
        uint8_t ch = doc["channel"] | 0;
        float v   = doc["value"]   | 0.0f;
        engine->pushExternal(ch, v);
    } else if (!strcmp(msgType, "ping")) {
        client->text("{\"type\":\"pong\"}");
    }
}

} // namespace haxel::web
